openfoam/shape_optimization/system/blockMeshDict
/*--------------------------------*Thien Phan*-------------------------------*\ 																
| =========                 |                                                 | 																
| \\      /  F ield         | OpenFOAM: phanquocthien.org                     |																
|  \\    /   O peration     | Files are generated by Thien Phan               | 																
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |																
|    \\/     M anipulation  |         PhanQuocThien@gmail.com                 | 																
\*---------------------------------------------------------------------------*/ 																
FoamFile																
{																
    version     2.0;																
    format      ascii;																
    class       dictionary;																
    object      blockMeshDict;																
}																
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //																
convertToMeters	1	;														
																
geometry																
{																
}																
																
vertices																
(																
	(	0	0	0	)	//	0									
	(	1	0	0	)	//	1									
	(	1	12	0	)	//	2									
	(	-11	0	0	)	//	3									
	(	0	0	0.3	)	//	4									
	(	1	0	0.3	)	//	5									
	(	1	12	0.3	)	//	6									
	(	-11	0	0.3	)	//	7									
	(	21	1.83027059770082	0	)	//	8									
	(	21	12	0	)	//	9									
	(	21	1.83027059770082	0.3	)	//	10									
	(	21	12	0.3	)	//	11									
	(	1	-12	0	)	//	12									
	(	1	-12	0.3	)	//	13									
	(	21	-12	0	)	//	14									
	(	21	-12	0.3	)	//	15									
	(	1	0	0	)	//	16									
	(	1	0	0.3	)	//	17									
																
);																
																
																
blocks																
(																
	hex	(0	1	2	3	4	5	6	7)	(	41	48	1	)	//block	1
	edgeGrading															
	(															
	//	x-direction	expansion	ratio												
	(															
(	0.4	0.51219512195122	3.5	)												
(	0.6	0.487804878048781	0.857142857142857	)												
	)															
	0.03	0.03														
	(															
(	0.4	0.51219512195122	3.5	)												
(	0.6	0.487804878048781	0.857142857142857	)												
	)															
	//	y-direction	expansion	ratio												
	(															
(	0.041666666666667	0.354166666666667	22.1861110674044	)												
(	0.958333333333333	0.645833333333333	9.0146488220659	)												
	)															
	(															
(	0.041666666666667	0.354166666666667	22.1861110674044	)												
(	0.958333333333333	0.645833333333333	9.0146488220659	)												
	)															
	(															
(	0.041666666666667	0.354166666666667	22.1861110674044	)												
(	0.958333333333333	0.645833333333333	9.0146488220659	)												
	)															
	(															
(	0.041666666666667	0.354166666666667	22.1861110674044	)												
(	0.958333333333333	0.645833333333333	9.0146488220659	)												
	)															
																
	//	z-direction	expansion	ratio												
	1	1	1	1												
	)															
																
	hex	(1	8	9	2	5	10	11	6)	(	74	48	1)	//block	2	
	edgeGrading															
	(															
	//	x-direction	expansion	ratio												
	33.3333333333333	33.3333333333333	33.3333333333333	33.3333333333333												
	//	y-direction	expansion	ratio												
	(															
(	0.041666666666667	0.354166666666667	22.1861110674044	)												
(	0.958333333333333	0.645833333333333	9.0146488220659	)												
	)															
	13.9581659180375	13.9581659180375														
	(															
(	0.041666666666667	0.354166666666667	22.1861110674044	)												
(	0.958333333333333	0.645833333333333	9.0146488220659	)												
	)															
																
	//	z-direction	expansion	ratio												
	1	1	1	1												
	)															
																
	hex	(3	12	16	0	7	13	17	4)	(	41	48	1	)	//block	3
	edgeGrading															
	(															
	//	x-direction	expansion	ratio												
	0.03															
	(															
(	0.4	0.51219512195122	3.5	)												
(	0.6	0.487804878048781	0.857142857142857	)												
	)															
	(															
(	0.4	0.51219512195122	3.5	)												
(	0.6	0.487804878048781	0.857142857142857	)												
	)															
	0.03															
	//	y-direction	expansion	ratio												
	(															
(	0.958333333333333	0.645833333333333	0.110930555337022	)												
(	0.041666666666667	0.354166666666667	0.04507324411033	)												
	)															
	(															
(	0.958333333333333	0.645833333333333	0.110930555337022	)												
(	0.041666666666667	0.354166666666667	0.04507324411033	)												
	)															
	(															
(	0.958333333333333	0.645833333333333	0.110930555337022	)												
(	0.041666666666667	0.354166666666667	0.04507324411033	)												
	)															
	(															
(	0.958333333333333	0.645833333333333	0.110930555337022	)												
(	0.041666666666667	0.354166666666667	0.04507324411033	)												
	)															
																
	//	z-direction	expansion	ratio												
	1	1	1	1												
	)															
																
																
																
																
																
	hex	(12	14	8	16	13	15	10	17)	(	74	48	1)	//block	4	
	edgeGrading															
	(															
	//	x-direction	expansion	ratio												
	33.3333333333333	33.3333333333333	33.3333333333333	33.3333333333333												
	//	y-direction	expansion	ratio												
	(															
(	0.958333333333333	0.645833333333333	0.110930555337022	)												
(	0.041666666666667	0.354166666666667	0.04507324411033	)												
	)															
	0.071642650321827	0.071642650321827														
	(															
(	0.958333333333333	0.645833333333333	0.110930555337022	)												
(	0.041666666666667	0.354166666666667	0.04507324411033	)												
	)															
																
	//	z-direction	expansion	ratio												
	1	1	1	1												
	)															
);																
																
																
edges																
(																
	arc	3 2	(	-7.48528137423857	8.48528137423857	0	)									
	arc	7 6 	(	-7.48528137423857	8.48528137423857	0.3	)									
																
	spline	1	0													
	(															
	(	0.999013364214136	0.00168649354893	0	)											
	(	0.996057350657239	0.002333626343485	0	)											
	(	0.991143625364344	0.003404372794392	0	)											
	(	0.984291580564316	0.004887083452176	0	)											
	(	0.975528258147577	0.00676557471759	0	)											
	(	0.964888242944126	0.009019254259954	0	)											
	(	0.95241352623301	0.011623281969261	0	)											
	(	0.938153340021932	0.014548766220807	0	)											
	(	0.922163962751008	0.017762995185657	0	)											
	(	0.904508497187474	0.021229702876156	0	)											
	(	0.885256621387895	0.024909369572481	0	)											
	(	0.864484313710706	0.028759556232796	0	)											
	(	0.842273552964344	0.032735272444255	0	)											
	(	0.818711994874345	0.036789377422251	0	)											
	(	0.793892626146236	0.040873013507501	0	)											
	(	0.767913397489498	0.044936071539592	0	)											
	(	0.740876837050858	0.048927687394822	0	)											
	(	0.712889645782536	0.052796768856718	0	)											
	(	0.684062276342339	0.056492551827669	0	)											
	(	0.654508497187474	0.059965184674907	0	)											
	(	0.624344943582427	0.063166339214521	0	)											
	(	0.593690657292862	0.066049846449517	0	)											
	(	0.562666616782152	0.068572695994764	0	)											
	(	0.531395259764657	0.070820036045517	0	)											
	(	0.5	0.072859720511009	0	)											
	(	0.468604740235343	0.074660398189935	0	)											
	(	0.437333383217848	0.076190517193882	0	)											
	(	0.406309342707138	0.077418357434098	0	)											
	(	0.375655056417573	0.078312029974982	0	)											
	(	0.345491502812526	0.078839429916347	0	)											
	(	0.315937723657661	0.07896812324845	0	)											
	(	0.287110354217464	0.078665138219403	0	)											
	(	0.259123162949142	0.07789661551765	0	)											
	(	0.232086602510502	0.076630650707198	0	)											
	(	0.206107373853763	0.074885034889837	0	)											
	(	0.181288005125655	0.072651326537571	0	)											
	(	0.157726447035656	0.06990474576689	0	)											
	(	0.135515686289294	0.066619689237604	0	)											
	(	0.114743378612105	0.062768666611257	0	)											
	(	0.095491502812526	0.058320448650871	0	)											
	(	0.077836037248993	0.053236713114148	0	)											
	(	0.061846659978068	0.047465594585534	0	)											
	(	0.04758647376699	0.041161274044147	0	)											
	(	0.035111757055874	0.034919518195738	0	)											
	(	0.024471741852423	0.028785122878013	0	)											
	(	0.015708419435685	0.02276653111134	0	)											
	(	0.008856374635656	0.016871650238696	0	)											
	(	0.003942649342761	0.011107836356387	0	)											
	(	0.000986635785864	0.005481880982467	0	)											
	)															
																
																
	spline	5	4													
	(															
	(	0.999013364214136	0.00168649354893	0.3	)											
	(	0.996057350657239	0.002333626343485	0.3	)											
	(	0.991143625364344	0.003404372794392	0.3	)											
	(	0.984291580564316	0.004887083452176	0.3	)											
	(	0.975528258147577	0.00676557471759	0.3	)											
	(	0.964888242944126	0.009019254259954	0.3	)											
	(	0.95241352623301	0.011623281969261	0.3	)											
	(	0.938153340021932	0.014548766220807	0.3	)											
	(	0.922163962751008	0.017762995185657	0.3	)											
	(	0.904508497187474	0.021229702876156	0.3	)											
	(	0.885256621387895	0.024909369572481	0.3	)											
	(	0.864484313710706	0.028759556232796	0.3	)											
	(	0.842273552964344	0.032735272444255	0.3	)											
	(	0.818711994874345	0.036789377422251	0.3	)											
	(	0.793892626146236	0.040873013507501	0.3	)											
	(	0.767913397489498	0.044936071539592	0.3	)											
	(	0.740876837050858	0.048927687394822	0.3	)											
	(	0.712889645782536	0.052796768856718	0.3	)											
	(	0.684062276342339	0.056492551827669	0.3	)											
	(	0.654508497187474	0.059965184674907	0.3	)											
	(	0.624344943582427	0.063166339214521	0.3	)											
	(	0.593690657292862	0.066049846449517	0.3	)											
	(	0.562666616782152	0.068572695994764	0.3	)											
	(	0.531395259764657	0.070820036045517	0.3	)											
	(	0.5	0.072859720511009	0.3	)											
	(	0.468604740235343	0.074660398189935	0.3	)											
	(	0.437333383217848	0.076190517193882	0.3	)											
	(	0.406309342707138	0.077418357434098	0.3	)											
	(	0.375655056417573	0.078312029974982	0.3	)											
	(	0.345491502812526	0.078839429916347	0.3	)											
	(	0.315937723657661	0.07896812324845	0.3	)											
	(	0.287110354217464	0.078665138219403	0.3	)											
	(	0.259123162949142	0.07789661551765	0.3	)											
	(	0.232086602510502	0.076630650707198	0.3	)											
	(	0.206107373853763	0.074885034889837	0.3	)											
	(	0.181288005125655	0.072651326537571	0.3	)											
	(	0.157726447035656	0.06990474576689	0.3	)											
	(	0.135515686289294	0.066619689237604	0.3	)											
	(	0.114743378612105	0.062768666611257	0.3	)											
	(	0.095491502812526	0.058320448650871	0.3	)											
	(	0.077836037248993	0.053236713114148	0.3	)											
	(	0.061846659978068	0.047465594585534	0.3	)											
	(	0.04758647376699	0.041161274044147	0.3	)											
	(	0.035111757055874	0.034919518195738	0.3	)											
	(	0.024471741852423	0.028785122878013	0.3	)											
	(	0.015708419435685	0.02276653111134	0.3	)											
	(	0.008856374635656	0.016871650238696	0.3	)											
	(	0.003942649342761	0.011107836356387	0.3	)											
	(	0.000986635785864	0.005481880982467	0.3	)											
	)															
																
																
	arc	3 12	(	-7.48528137423857	-8.48528137423857	0	)									
	arc	7 13	(	-7.48528137423857	-8.48528137423857	0.3	)									
																
	spline	0	16													
	(															
	(	0.000986635785864	-0.005431332018934	0	)											
	(	0.003942649342761	-0.010364293209721	0	)											
	(	0.008856374635656	-0.014796204414609	0	)											
	(	0.015708419435685	-0.018726330737459	0	)											
	(	0.024471741852423	-0.022155867908059	0	)											
	(	0.035111757055874	-0.025087921076185	0	)											
	(	0.04758647376699	-0.027527476135349	0	)											
	(	0.061846659978068	-0.029571090942434	0	)											
	(	0.077836037248993	-0.031521137562457	0	)											
	(	0.095491502812526	-0.033403541577367	0	)											
	(	0.114743378612105	-0.03521971319956	0	)											
	(	0.135515686289294	-0.036970553868911	0	)											
	(	0.157726447035656	-0.038656719624258	0	)											
	(	0.181288005125655	-0.040278766053826	0	)											
	(	0.206107373853763	-0.041837231231213	0	)											
	(	0.232086602510502	-0.043151664184168	0	)											
	(	0.259123162949142	-0.043914716370658	0	)											
	(	0.287110354217464	-0.044196970544998	0	)											
	(	0.315937723657661	-0.0440598900101	0	)											
	(	0.345491502812526	-0.043552916085549	0	)											
	(	0.375655056417573	-0.042717870889877	0	)											
	(	0.406309342707138	-0.041591542668822	0	)											
	(	0.437333383217848	-0.040207271758376	0	)											
	(	0.468604740235343	-0.038595954106482	0	)											
	(	0.5	-0.036786688939284	0	)											
	(	0.531395259764657	-0.034815925457544	0	)											
	(	0.562666616782152	-0.032789843523227	0	)											
	(	0.593690657292862	-0.030742478929037	0	)											
	(	0.624344943582427	-0.028685827468417	0	)											
	(	0.654508497187474	-0.026631779803473	0	)											
	(	0.684062276342339	-0.02459206990361	0	)											
	(	0.712889645782536	-0.022578224408315	0	)											
	(	0.740876837050858	-0.02060151308556	0	)											
	(	0.767913397489498	-0.018672900560216	0	)											
	(	0.793892626146236	-0.016802999487153	0	)											
	(	0.818711994874345	-0.015002025342006	0	)											
	(	0.842273552964344	-0.013279752999209	0	)											
	(	0.864484313710706	-0.011645475262101	0	)											
	(	0.885256621387895	-0.010107963503924	0	)											
	(	0.904508497187474	-0.008675430571515	0	)											
	(	0.922163962751008	-0.00735549609554	0	)											
	(	0.938153340021932	-0.006155154342372	0	)											
	(	0.95241352623301	-0.005080744733267	0	)											
	(	0.964888242944126	-0.004137925146331	0	)											
	(	0.975528258147577	-0.003331648106161	0	)											
	(	0.984291580564316	-0.002666139954811	0	)											
	(	0.991143625364344	-0.002144883086154	0	)											
	(	0.996057350657239	-0.001770601313686	0	)											
	(	0.999013364214136	-0.001545248429559	0	)											
	)															
																
																
	spline	4	17													
	(															
	(	0.000986635785864	-0.005431332018934	0.3	)											
	(	0.003942649342761	-0.010364293209721	0.3	)											
	(	0.008856374635656	-0.014796204414609	0.3	)											
	(	0.015708419435685	-0.018726330737459	0.3	)											
	(	0.024471741852423	-0.022155867908059	0.3	)											
	(	0.035111757055874	-0.025087921076185	0.3	)											
	(	0.04758647376699	-0.027527476135349	0.3	)											
	(	0.061846659978068	-0.029571090942434	0.3	)											
	(	0.077836037248993	-0.031521137562457	0.3	)											
	(	0.095491502812526	-0.033403541577367	0.3	)											
	(	0.114743378612105	-0.03521971319956	0.3	)											
	(	0.135515686289294	-0.036970553868911	0.3	)											
	(	0.157726447035656	-0.038656719624258	0.3	)											
	(	0.181288005125655	-0.040278766053826	0.3	)											
	(	0.206107373853763	-0.041837231231213	0.3	)											
	(	0.232086602510502	-0.043151664184168	0.3	)											
	(	0.259123162949142	-0.043914716370658	0.3	)											
	(	0.287110354217464	-0.044196970544998	0.3	)											
	(	0.315937723657661	-0.0440598900101	0.3	)											
	(	0.345491502812526	-0.043552916085549	0.3	)											
	(	0.375655056417573	-0.042717870889877	0.3	)											
	(	0.406309342707138	-0.041591542668822	0.3	)											
	(	0.437333383217848	-0.040207271758376	0.3	)											
	(	0.468604740235343	-0.038595954106482	0.3	)											
	(	0.5	-0.036786688939284	0.3	)											
	(	0.531395259764657	-0.034815925457544	0.3	)											
	(	0.562666616782152	-0.032789843523227	0.3	)											
	(	0.593690657292862	-0.030742478929037	0.3	)											
	(	0.624344943582427	-0.028685827468417	0.3	)											
	(	0.654508497187474	-0.026631779803473	0.3	)											
	(	0.684062276342339	-0.02459206990361	0.3	)											
	(	0.712889645782536	-0.022578224408315	0.3	)											
	(	0.740876837050858	-0.02060151308556	0.3	)											
	(	0.767913397489498	-0.018672900560216	0.3	)											
	(	0.793892626146236	-0.016802999487153	0.3	)											
	(	0.818711994874345	-0.015002025342006	0.3	)											
	(	0.842273552964344	-0.013279752999209	0.3	)											
	(	0.864484313710706	-0.011645475262101	0.3	)											
	(	0.885256621387895	-0.010107963503924	0.3	)											
	(	0.904508497187474	-0.008675430571515	0.3	)											
	(	0.922163962751008	-0.00735549609554	0.3	)											
	(	0.938153340021932	-0.006155154342372	0.3	)											
	(	0.95241352623301	-0.005080744733267	0.3	)											
	(	0.964888242944126	-0.004137925146331	0.3	)											
	(	0.975528258147577	-0.003331648106161	0.3	)											
	(	0.984291580564316	-0.002666139954811	0.3	)											
	(	0.991143625364344	-0.002144883086154	0.3	)											
	(	0.996057350657239	-0.001770601313686	0.3	)											
	(	0.999013364214136	-0.001545248429559	0.3	)											
	)															
																
																
);																
																
faces																
(																
																
);																
																
faces																
(																
  																
);																
																
																
defaultPatch																
{																
    name frontAndBack;																
    type empty;																
}																
																
boundary																
(																
inlet              // patch name																
        {																
            type patch;    // patch type for patch 0																
            faces																
            (																
                (9 2 6 11)  // block face in this patch																
                (2 3 7 6  )  // block face in this patch																
                (3 12 13 7  )  // block face in this patch																
                (12 15 14 13  )  // block face in this patch																
            );																
        } 																
																
outlet              // patch name																
        {																
            type patch;    // patch type for patch 0																
            faces																
            (																
                (8 9 10 11)  // block face in this patch																
                (15 8 10 14  )  // block face in this patch																
            );																
        }																
																
walls              // patch name																
        {																
            type wall;    // patch type for patch 0																
            faces																
            (																
                (0 1 5 4)  // block face in this patch																
                (0 4 17 16  )  // block face in this patch																
            );																
        } 																
																
interface1              // patch name																
        {																
            type patch;    // patch type for patch 0																
            faces																
            (																
                (1 8 10 5)  // block face in this patch																
            );																
        } 																
interface2              // patch name																
        {																
            type patch;    // patch type for patch 0																
            faces																
            (																
                (16 17 10 8)  // block face in this patch																
            );																
        } 																
);																
																
 mergePatchPairs																
(																
    ( interface1 interface2 ) 																
);																
// ************************************************************************* //																

